{
  "experiences": [
    {
      "title": "Lead Software Engineer",
      "subtitle": "Dannie.CC, Antalya, Turkey",
      "workType": "Full-time",
      "workDescription": [
        "Drove ERP and MES architectural evolution by breaking down a monolithic platform into independently deployable services, improving maintainability and cutting feature delivery time from 1 month to 1 week.",
        "Unified code reviews and transparency to prevent information siloing, resulting in a 25% iteration reduction.",
        "Refined team KPIs and organized the tasks to prioritize quality over volume, achieving all KPI goals for 6 quarters.",
        "Took the initiative to plan periodic improvement meetings to cut the ERP response times by 35% during peak hours.",
        "Mentored and accelerated the technical growth of 3 junior engineers, boosting the team productivity by 20%.",
        "Accelerated IATF 16949 certification readiness by aligning software processes to meet complex automotive requirements.",
        "Collaborated with executive leadership to design ERP/MES systems, turning intricate business needs into technical objectives that enabled a 40% expansion in operational scope.",
        "Empowered QA to bridge 9 departments, translating feedback into actionable tasks for 100% alignment with company goals."
      ],
      "dateText": "01/2025 - Present"
    },
    {
      "title": "Senior Backend Software Engineer",
      "subtitle": "Dannie.CC, Antalya, Turkey",
      "workType": "Full-time",
      "workDescription": [
        "Architected a Server-Driven UI (SDUI) framework using WebSockets, allowing the backend to dynamically render complex app modules and reducing frontend deployment needs by 80%.",
        "The core platform's migration to TypeScript reduced the onboarding time for future developers from three months to one month by removing architectural ambiguity and ensuring safety across complex data fragments.",
        "Optimized ArangoDB queries to reduce latency to 60 ms under high peak loads, increasing the ERP app's speed by three times.",
        "Utilizing WebSocket's event-driven architecture, unit tracking on all production lines was established with nearly zero latency."
      ],
      "dateText": "12/2023 - 01/2025"
    },
    {
      "title": "Senior Backend Software Engineer",
      "subtitle": "Actimi GmbH, Antalya, Turkey",
      "workType": "Full-time",
      "workDescription": [
        "Optimized Aidbox and Medplum FHIR-based data models, redesigning PostgreSQL schemas to reduce complex query latency by 30% for German healthcare providers.",
        "Engineered a secure remote fleet management system via Zoho MDM API to automate the lifecycle of distributed tablets used by patients and practitioners.",
        "Developed a robust data-wiping and UUID-regeneration workflow for device reassignment, ensuring 100% GDPR and HIPAA compliance during patient transitions.",
        "Spearheaded a platform-wide migration from JavaScript to TypeScript, introducing strict type-safety and reducing new developer onboarding from 3 months to 1 month.",
        "Tripled procurement app performance by optimizing ArangoDB (AQL) queries and halving system latency to 60ms under peak loads of 1,500+ requests per second.",
        "Refactored Docker and CI/CD pipelines on GCP, slashing development server deployment times from 15 minutes to 2 minutes (85% efficiency gain).",
        "Established standardized backend data validation checks that eliminated daily synchronization errors between the factory floor and management systems.",
        "Collaborated with the CTO to define the 'Implementation Flow,' from UI/UX design approval to automated testing and UAT (User Acceptance Testing) cycles."
      ],
      "dateText": "12/2022 - 12/2023"
    },
    {
      "title": "Freelance Architect & Technical Consultant",
      "subtitle": "Remote (US-based Clients)",
      "workType": "Contracts",
      "workDescription": [
        "Audited and enhanced 4 Cryptocurrency platforms, delivering 30% performance improvement.",
        "Designed and implemented secure OTC, P2P, and HD wallet solutions, reducing development cost by more than half.",
        "Resolved more than 50 major architectural flaws by standardizing core components.",
        "Advised clients on best architecture for performance, scalability, and cost.",
        "Created reports on project progress and requirements to plan new features.",
        "Investigated and resolved defects raised by users and other developers."
      ],
      "dateText": "06/2022 - 12/2022"
    },
    {
      "title": "Lead Software Engineer",
      "subtitle": "DigiAlpha, Tehran, Iran",
      "workType": "Full-time",
      "workDescription": [
        "Architected a high-frequency trading engine supporting Crypto Exchange, OTC, and Copy-Trading, achieving a 30% gain in order-matching speed.",
        "Designed a non-blocking matching algorithm for complex order types (Margin, Stop-Loss), preventing parallel execution bottlenecks during high market volatility.",
        "Re-engineered microservices communication using RabbitMQ to synchronize real-time price feeds and wallet balances, doubling system throughput.",
        "Developed a proprietary HD Wallet service and an internal ledger system to manage physical crypto assets and virtual balances with high precision.",
        "Implemented a 3-tier KYC (Know Your Customer) verification service, integrating national ID and bank info verification for different user trust levels.",
        "Optimized blockchain node synchronization using a 'half-node' flow strategy, significantly reducing storage overhead while maintaining real-time data accuracy.",
        "Scaled the engineering department from 4 to 9 developers, acting as a technical lead and Scrum Master to ensure high code quality and architectural integrity.",
        "Defined clean-code standards and established an event-driven architecture that eliminated zero-message loss during peak trading volumes."
      ],
      "dateText": "06/2021 - 06/2022"
    },
    {
      "title": "Lead BackEnd Software Engineer",
      "subtitle": "Mobisoft, Tehran, Iran",
      "workType": "Full-time",
      "workDescription": [
        "Took ownership of a social networking platform across web, iOS, and Android, leading a 12-member team.",
        "Led project reviews and conflict resolution, maintaining consistent on-time delivery across weekly release cycles.",
        "Improved WebRTC signalling protocols for multi-party video conferencing to boost efficiency by 40%.",
        "Managed and guided a large cross-functional team, preparing detailed weekly reports and resolving conflicts."
      ],
      "dateText": "05/2020 - 05/2021"
    },
    {
      "title": "Backend Software Engineer",
      "subtitle": "Irantom, Tehran, Iran",
      "workType": "Full-time",
      "workDescription": [
        "Architected and maintained a distributed CRM ecosystem consisting of 30+ Node.js microservices, including Auth, Messaging, and Multitenancy modules.",
        "Leveraged a polyglot persistence strategy using MongoDB, MySQL, and Elasticsearch to optimize data retrieval and storage efficiency across the platform.",
        "Collaborated with a 16-member engineering team to refactor legacy bottlenecks, improving API response times by 25% and enhancing overall system stability.",
        "Streamlined the development lifecycle by implementing Swagger/OpenAPI documentation, reducing manual documentation time and overhead by 40%.",
        "Translated complex user requirements into technical implementation plans, leading two-week Agile sprints to ensure consistent feature delivery.",
        "Engineered scalable RESTful APIs with a focus on high availability, ensuring the CRM could support increasing user loads and data complexity."
      ],
      "dateText": "11/2018 - 04/2020"
    },
    {
      "title": "Backend Software Engineer",
      "subtitle": "Goki, Tehran, Iran",
      "workType": "Full-time",
      "workDescription": [
        "Collaborated with 4 development teams to analyze and implement services based on client needs.",
        "Developed, tested, and deployed 6-7 web projects, meeting 100% client delivery deadlines.",
        "Represented the web development team in weekly meetings with executives to discuss project goals and milestones.",
        "Adjusted software parameters and incorporated new features to boost performance."
      ],
      "dateText": "03/2016 - 09/2018"
    }
  ]
}
