{
  "about": "### Lead Backend Architect & People-First Leader\n\nWith over a decade of experience as a **Lead Backend Architect**, I specialize in building the digital foundations for high-stakes industries like **Fintech and HealthTech**. My approach goes beyond just writing code; I focus on transforming messy, complex system challenges into organized, reliable architectures. By bridging the gap between technical precision and business goals, I ensure that companies can scale their operations smoothly without the technical debt that often leads to \"growing pains.\"\n\n#### Leadership & Mentorship\n\nI am a \"people-first\" leader who believes that a system is only as strong as the team behind it. I have a proven track record of managing and mentoring teams of up to **12 developers**, fostering an environment of clear communication and professional growth. My leadership style is rooted in the idea that when developers are supported and mentored, the software they produce is naturally more robust and maintainable.\n\n#### Technical Expertise\n\nOn the technical side, my background is quite diverse, ranging from low-level languages like **C++ and C#** to modern environments like **Node.js and TypeScript**. Whether I am designing a traditional Monolithic system or a modern Microservices network, I prioritize efficiency and data integrity. I am equally comfortable working with SQL and NoSQL databases, and I have a disciplined approach to testing—using frameworks like **Jest and Mocha**—to guarantee that every solution is stable before it reaches production.\n\n#### Global Availability\n\nCurrently based in **Antalya** with a valid, transferable Turkish work permit, I am ready for immediate local onboarding. However, my experience is global; I am fully equipped to support teams across **European or North American** time zones. Combining my Master’s-level analytical depth with a practical, hands-on approach to backend engineering, I am eager to help your organization build high-performance systems that are truly built to last.",
  "imageSource": "images/about/me.jpg",
  "imageSource2": "images/about/me2.jpg"
}
